src/test/load-test/main.yaml
settings:
  env:
    CONCURRENCY: 3
    TEST_TIME: 1m
    RAMP_UP: 0m
    SCENARIO: SendNotification
    INPUT_FILE: inputs/pa_protocol_input.csv
    API_KEY: fakeapikey
    PA: LoadTestPa
    BASE_URL: http://localhost:8080

execution:
  - executor: jmeter
    concurrency: ${CONCURRENCY}
    hold-for: ${TEST_TIME}
    ramp-up: ${RAMP_UP}
    scenario: ${SCENARIO}
      #script: ${SCRIPT}

reporting:
#  - module: passfail
#    criteria:
#      - avg-rt of IndexPage>150ms for 10s, stop as failed
#      - fail of CheckoutPage>50% for 10s, stop as failed
#  - module: junit-xml
#    data-source: pass-fail
  - module: console
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    concurrency: true
    dump-cvs: output.csv
#  - module: junit-xml
#    data-source: pass-fail
#  - module: final-stats
#    dump-cvs: output.csv

included-configs:
  - taurus/SendNotificationScenarios.yaml
  - taurus/SearchNotificationScenarios.yaml